Repository: kamperh/kamperh.github.io
Catalog: data/siyavula_en_af.3.tmx
Source language: en
Languages: af

source: good coverage of information and new knowledge understanding; some evidence of paraphrasing
af: goeie dekking van inligting en nuwe kennis begrip; bewyse van goeie parafrasering

source: adequate and fairly precise knowledge gathered .
af: genoegsame en redelik presiese kennis ingesamel .

source: mostly copied information .
af: meestal gekopieerde inligting .

source: information gathered by copying and pasting information in random without much planning .
af: inligting ingesamel deur lukraak te kopieer en in te voeg sonder veel beplanning .

source: not much information gathered .
af: nie veel inligting ingesamel nie .

source: some information is space filling and serves little purpose .
af: van die inligting vul net ruimte en dien geen doel nie .

source: interview skills
af: onderhoudvoerings vaardighede

source: questions and answers displays very clear understanding of processes involved and information needed .
af: vrae en antwoorde toon 'n duidelike begrip van die prosesse wat betrokke is en die inligting wat benodig word .

source: questions are clear and to the point though not always focused .
af: vrae is duidelik en op die man af alhoewel nie altyd gefokus nie .

source: some answers are well structured .
af: sommige antwoorde is wel gestruktureerd .

source: at least 1 2 of questions are well structured formulated but not always relevant and focused .
af: ten minste een helfte van die vrae is goed gestruktureerd geformuleer maar nie altyd relevant en gefokus nie .

source: some questions were formulated well but these are not in any particular order and do not flow one from the other .
af: sommige vrae is goed geformuleer maar hulle is nie in enige volgorde nie en vloei nie van die een na die ander nie .

source: questions don't always pertain to the topic .
af: vrae het nie altyd met die onderwerp te doen nie .

source: some questions are difficult to understand .
af: sommige vrae is moeilik om te verstaan .

source: did not formulate 10 questions .
af: het nie 10 vrae geformuleer nie .

source: ability to synthesise information in a summary
af: vermo om inligting te integreer in 'n opsomming .

source: summary creates a very good overview of main ideas .
af: die opsomming gee 'n baie goeie oorsig van die hoofidees .

source: clear and precise synthesis of information from research and interview .
af: duidelike en presiese sintese van inligting vanuit die navorsing en die onderhoud .

source: summary is fairly concise and contains many main ideas but often supporting ideas have been included as well making it too long .
af: opsomming is betreklik saaklik en bevat die hoofpunte maar ondersteunende idees is ingesluit wat dit te lank maak .

source: summary is in places a copy of the previous texts .
af: die opsomming is in sommige plekke 'n reproduksie van die vorige teks .

source: some main and many supportive ideas included .
af: sommige hoof en baie ondersteunende idees is ingesluit .

source: incomplete .
af: onvolledig .

source: summary is very short and contains only a few strands of information .
af: opsomming is baie kort en bevat slegs 'n paar stringe inligting .

source: imprecise and lacking .
af: dit is nie presies nie en kort inligting .

source: if summary is included it is no more than one or at the most two short sentences .
af: as die opsomming wel ingesluit is is dit nie meer as een of op die meeste twee sinne nie .

source: incomplete and containing many misunderstandings
af: dit is onvolledig en bevat baie misverstande .

source: referencing and bibliography
af: verwysing en bibliografie

source: all references are noted and bibliography is complete and well presented .
af: alle verwysings is aangedui en die bibliografie is volledig en word goed voorgel .

source: some sources acknowledged and referenced .
af: sommige bronne is erken en aangedui .

source: fairly good bibliography .
af: betreklike goeie bibliografie .

source: one or two sources acknowledged .
af: een of twee bronne is aangedui .

source: bibliography contains titles yet incomplete .
af: bibliografie bevat titels maar is onvolledig .

source: no sources referenced in text but one or two sources were included in bibliography .
af: geen bronne is in die teks aangedui nie maar een of twee bronne is by die bibliografie ingesluit .

source: no bibliography or referencing of sources .
af: geen bibliografie of verwysing na bronne nie .

source: general impression of presentation
af: algemene indruk van die voorlegging

source: well presented neat and creative presentation .
af: goed voorgestel netjies en kreatiewe voorlegging .

source: good use of language and resources .
af: goeie taalgebruik en bronne .

source: interactive and lively .
af: interaktief en lewendig .

source: fairly well presented but could be neater .
af: betreklik goed voorgestel maar kan netjieser wees .

source: presentation was good .
af: voorlegging was goed .

source: fair amount of effort applied .
af: redelike hoeveelheid moeite is gedoen .

source: some effort applied but presentation could be far more creative and interesting .
af: moeite is gedoen maar die voorlegging kon meer kreatief en interessant gewees het .

source: could have used resources more effectively
af: kon bronne meer effektief gebruik het .

source: presentation was generally simplistic with little use of colour layout or creativity .
af: voorlegging was oor die algemeen eenvoudig met min gebruik van kleur uitleg of kreatiwiteit .

source: at times the reader feels confused and cannot follow .
af: by tye voel die leser verward en sukkel om te volg .

source: presentation was untidy and sloppy .
af: voorlegging was swak en slordig .

source: information was inaccurate .
af: inligting was onakkuraat .

source: poor use of language .
af: swak gebruik van taal .

source: very little evidence of effort applied .
af: baie min bewyse of moeite ingesit .

source: effective use of information to process food
af: effektiewe gebruik van kennis om kos te verwerk

source: used knowledge and understanding gained in research and interview very effectively to plan food processing .
af: het die kennis en begrip wat verkry is uit navorsing en die onderhoud baie effektief gebruik om voedselverwerking te beplan .

source: fairly good understanding of food processing procedure and application in own process .
af: betreklike goeie begrip van voedsel prosesserings prosedure en dit is toegepas in eie proses .

source: good correlation between some aspects learnt and practical application though not all .
af: goeie korrelasie tussen sekere aspekte wat geleer is en praktiese toepassing alhoewel nie alles nie .

source: applied at least 3 theoretical concepts learnt but could not sustain this without support .
af: het ten minste drie teoretiese konsepte wat geleer is toegepas maar kon dit nie volhou sonder ondersteuning nie .

source: could not correlate knowledge from research with practical application .
af: kon nie kennis uit die navorsing korreleer met praktiese toepassing nie .

source: appropriate choice of food to process
af: toepaslike keuse van voedsel om te verwerk

source: excellent choice guided by research interview and food availability .
af: uitstekende keuse gelei deur navorsing onderhoud en voedsel beskikbaarheid .

source: considered majority of constraints and made a good choice .
af: het die meeste struikelblokke oorweeg en 'n goeie keuse gemaak .

source: choice was made difficult as did not consider all constraints .
af: keuse is moeilik gemaak deur die feit dat die struikelblokke nie oorweeg is nie .

source: chose a random food that posed tremendous problems as did not consider all constraints .
af: het 'n lukrake keuse gemaak wat groot probleme opgelewer het aangesien die struikelblokke nie oorweeg is nie .

source: did not prepare beforehand .
af: het nie vooraf voorberei nie .

source: chose inappropriate food .
af: kies 'n ontoepaslike voedselitem .

source: outcome of the food processing
af: uitkoms van die voedselverwerking .

source: food was very well processed and looked and tasted delicious .
af: voedsel is baie goed verwerk en lyk en smaak heerlik .

source: some items were processed correctly and looked and tasted fine .
af: sommige items is goed verwerk en lyk en smaak aanvaarbaar .

source: one or two items were successfully processed .
af: een of twee items is suksesvol verwerk .

source: others 'didn't work'
af: ander het nie gewerk nie .

source: although the idea was correct the result did not work and tasted looked unappetising .
af: alhoewel die idee korrek was het die resultaat nie gewerk nie en dit smaak en lyk onaantreklik .

source: lack of preparation thus food processing was unsuccessful .
af: gebrek aan voorbereiding en daarom is verwerking onsuksesvol .

source: demonstration of food processing
af: demonstrasie van voedselprosessering

source: demonstration was lively and entertaining .
af: demonstrasie is lewendig en vermaaklik .

source: audience enjoyed it very much !
af: die gehoor het dit baie geniet !

source: demonstration was fairly well presented yet with a few hiccups .
af: demonstrasie is redelik goed gedoen met 'n paar haakplekke .

source: very nervous presenting yet tried hard .
af: baie gespanne tydens voorlegging maar probeer baie hard .

source: audience was lost in places .
af: gehoor was plek plek verlore .

source: demonstration was short incomplete .
af: demonstrasie was kort onvolledig .

source: battled to explain the process .
af: sukkel om die proses te verduidelik .

source: tried to present demonstrate but lacked confidence or understanding of process .
af: probeer voorlegging gee demonstreer maar het nie die selfvertroue nie of verstaan nie die proses nie .

source: breakdown of steps to process food
af: afbreek van stappe om voedsel te verwerk .

source: very precise and clear breakdown of steps .
af: baie presiese en duidelike uiteensetting van stappe .

source: fairly precise yet not always clearly communicated breakdown of steps .
af: betreklik presies maar nie altyd duidelike kommunikasie oor die uiteensetting van stappe nie .

source: steps were not well ordered but could break down process in main phases .
af: stappe is nie goed georganiseer nie maar kon stappe in die hooffases opbreek .

source: could only identify some of the main phases but not in logical order .
af: kon slegs sommige van die hooffases identifiseer maar nie in 'n logiese volgorde nie .

source: needed much prompting to identify one or two of the main phases in the process. .
af: het baie leiding nodig gehad om een of twee van die hooffases van die proses te identifiseer .

source: total
af: totaal

source: write a definition for 'food processing' that will explain what it means .
af: skryf 'n definisie neer vir voedselprosessering wat die betekenis daarvan sal verduidelik .

source: changing raw animal or plant material into products and food that we can eat and use .
af: die verandering van dierlike of plantmateriaal in produkte en voedsels wat ons kan eet en gebruik .

source: there are three main reasons why we process food .
af: daar is drie hoofredes waarom ons voedsel prosesseer.verduidelik wat bedoel word met die volgende woorde wat verband hou met voedselprosessering .

source: preserving
af: preservering

source: cooking frying
af: kook braai

source: fermenting
af: fermentasie

source: many people believe that processing food is not good for their health .
af: baie mense glo dat die verwerking van voedsel sleg is vir hulle gesondheid .

source: list three possible drawbacks of food processing .
af: lys drie moontlike nadele van voedselverwerking .

source: describe how you would preserve extra fish that you had caught while on an overnight camping trip .
af: beskryf hoe jy ekstra vis wat tydens 'n oornag kampeeruitstappie gevang het sal preserveer .

source: clean and gut the fish; wash it in salt water and fillet the fish; sprinkle course salt and spices over it; hang it to air dry in a well ventilated space away from scavengers and pesky insects .
af: maak die vis skoon en verwyder die binnegoed; was die vis in sout water en sny die vis in filette; sprinkel growwe sout en speserye oor; hang die vis op om lugdroog te word in 'n goed geventileerde area buite die bereik van aasvreters en lastige insekte .

source: a farmer wants to export table grapes to australia from his farm near worcester in the western cape .
af: 'n boer wil tafeldruiwe vanaf sy plaas naby worcester in die wes kaap na australi uitvoer .

source: suggest the best form of transport that you know of that he should use and explain why you gave him this advice .
af: stel die beste vorm van vervoer waarvan hy gebruik kan maak voor en verduidelik waarom jy hom hierdie raad gegee het .

source: he should pack these grapes in special boxes that will protect them and place these directly into cold rooms .
af: hy behoort die druiwe in papier toe te draai en in spesiale kartonbokse te pak wat hulle sal beskerm .

source: a special cooling truck should fetch these boxes and take them to the airport from where they can fly to australia in the freight planes .
af: dan moet hy die kartonbokse direk in koelkamers plaas .

source: below is a table .
af: hieronder is 'n tabel .

source: next to each item in column a write the degree to which the raw materials were processed .
af: skryf die mate waartoe die rou materiaal verwerk is langs elke item in kolom a neer .

source: mealie bread
af: mieliebrood

source: fresh mealie washed and half way peeled packaged in a styrofoam container
af: vars gewaste mielie halfgeskil en in polistireenskuim verpak

source: sunflower oil
af: sonneblomolie

source: explain why many people believe that highly processed food is bad for your health .
af: verduidelik hoekom baie mense glo dat hoogsverwerkte voedsel sleg vir jou gesondheid is .

source: the food processes involved in making highly processed foods destroy many nutrients .
af: die voedselprosesse wat betrokke is in die verwerking van hoogsverwerkte voedsels vernietig baie voedingstowwe .

source: some methods of processing add a lot of extra sugar fats or oils .
af: sommige voedselverwerkingsmetodes voeg baie ekstra suiker vette of olies by .

source: compare the methods of any two food processing techniques .
af: vergelyk die voedselverwerkingsmetodes van enige twee voedselverwerkingstegnieke .

source: here the idea is that learners use their project's information to support their explanation of the food processing methods .
af: die idee is dat leerders die inligting van hul projek gebruik om hul verduideliking van die voedselverwerkingsmetodes te ondersteun .

source: write a short paragraph summarising what you have learnt about food processing and why you think it is important in your daily life .
af: skryf 'n kort paragraaf wat 'n opsomming gee oor wat jy geleer het van voedselverwerking en hoekom jy dink dat dit belangrik vir jou daaglikse lewe is .

source: learner directed answer .
af: leerder afhanklike antwoord .

source: many of the concepts in this unit revise work done in gr. 5 with the consequence that this unit has taken a different approach these topics were not dealt with in depth but given a good clear introduction to revisit and acknowledge existing knowledge and then we move to a stronger focus on environmental problems and permaculture as one of many positive solutions .
af: baie van die konsepte in hierdie eenheid is 'n hersiening van die werk wat in graad 5 gedoen is met die gevolg dat hierdie eenheid 'n ander benadering volg hierdie onderwerpe is nie in diepte behandel nie maar 'n goeie duidelike inleiding is gegee om bestaande kennis te hersien en herken .

source: if at all possible watch the video clip on permaculture it is fantastic and inspirational and makes for far more positive reading than the doom and gloom that tends to dominate the media today .
af: dan beweeg ons na 'n sterker fokus oor die omgewingsprobleme en permakultuur as een van vele positiewe oplossings beskikbaar .

source: nothing in the world can live truly on its own .
af: niks kan werklik op sy eie in die wreld lewe nie .

source: no plant or animal and certainly no human .
af: geen plant of dier en beslis nie 'n mens nie .

source: living things are connected to each other they depend on each other and on the non living things in their environments .
af: lewende dinge is met mekaar verbind hulle is afhanklik van mekaar en van die nie lewende dinge in hul omgewings .

source: in this chapter we will take a closer look at ecosystems and examine the different kinds of ecosystems that we get around the world see how animals plants and microorganisms depend on each other and learn about food webs and feeding relationships in an ecosystem .
af: in hierdie hoofstuk sal ons ekosisteme van naderby bekyk en die verskillende soorte ekosisteme ondersoek wat oor die hele wreld bestaan leer hoe diere plante en mikro organismes van mekaar afhanklik is en leer oor voedselwebbe en voedingsverhoudings in 'nekosisteem .

source: an ecosystem is an area where living and nonliving things depend on each other in many different ways .
af: 'n ekosisteem is 'n gebied waar lewende en nie lewende dinge op baie verskillende maniere van mekaar afhanklik is .

source: an ecosystem can survive on its own without any help or products from any other sources because the living and nonliving things in the ecosystem depend on each other for their survival .
af: 'nekosisteem kan op sy eie voortbestaan sonder enige hulp en produkte van ander bronne omdat die lewende en nie lewende dinge in die ekosisteem op mekaar mekaar kan steun vir oorlewing .

source: there are many different types of ecosystems on our planet
af: daar is baie verskillende soorte ekosisteme op ons planeet

source: in america grasslands are prairies and in asia they are called steppes; in south america they call it the pampas and in south africa we often call it bushveld or savanna .
af: in amerika word grasvelde prries of grasvlaktes genoem en in asi word hulle steppe genoem; in suid amerika word hulle die pampas genoem en in suid afrika bosveld of savanna .

source: answers also assess learner's descriptions in terms of the physical features of the ecosystem and how the plants and animals might benefit from these conditions .
af: antwoorde assesseer ook die leerder se beskrywings in terme van die fisiese eienskappe van die ekosisteem en hoe die plante endiere uit hierdie toestande mag voordeel trek .

source: south africa's fynbos region is unique it produces an incredible array of plants and specifically flowers .
af: suid afrika se fynbosstreek is uniek dit bevat 'n ongelooflike verskeidenheid plante en in die besonder blomme .

source: our national symbol the protea grows wild here and nowhere else in the entire world !
af: ons nasionale simbool die koningsprotea groei natuurlik hier en nrens anders in die wreld nie !

source: south africa is famous for its fynbos it does not grow naturally anywhere else in the world !
af: suid afrika is bekend vir sy fynbos dit groei nrens anders in die wreld nie !

source: fynbos plants are especially adapted to survive the climatic conditions and frequent fires .
af: fynbosplante is spesiaal aangepas om die klimaatstoestande en gereelde brande te oorleef .

source: the low bushes can survive the harsh windy conditions and the plants produce seeds that can very often only germinate once they had been scorched by fire .
af: die lae bosse kan die strawwe winderige toestande oorleef en die plante lewer saad wat soms net kan ontkiem wanneer dit deur vuur geskroei is .

source: the fynbos biome in south africa has a huge biodiversity in plants and animals .
af: die fynbos bioom in suid afrika het 'n groot biodiversiteit van plante en diere .

source: in an ecosystem there are certain relationships between the living things and the non living things in a particular area .
af: in 'n ekosisteem is daar sekere verhoudings tussen die lewende dinge en die nie lewende dinge in 'n bepaalde gebied .

source: a healthy ecosystem is one in which there is a balance between the non living and living things. a healthy ecosystem also depends on sufficient biodiversity of plants animals and their habitats .
af: 'n gesonde ekosisteem is een waarin daar 'n balans tussen die nie lewende en lewende dinge bestaan .

source: we saw at the beginning of the term that plants depend on air water and sunlight in order to make their food .
af: ons het aan die begin van die kwartaal geleer dat plante van lug water en sonlig afhanklik is om hul kos te vervaardig .

source: do you remember what this process is called? !
af: kan jy onthou wat hierdie proses genoem word ?

source: what are some of the non living things in an ecosystem ?
af: noem 'n paar van die nie lewende dinge in 'nekosisteem .

source: air sunlight water soil
af: lug sonlig water grond

source: what does biodiversity mean ?
af: wat beteken biodiversiteit ?

source: biodiversity refers to the variety in the species of organisms plants and animals in a given habitat .
af: biodiversiteit verwys na die verskeidenheid spesies van organismes plante en diere in 'n gegewe habitat .

source: animals also depend on the non living things in their ecosystem .
af: diere is ook afhanklik van die nie lewende dinge in hulle ekosisteem .

source: all animals need to breathe oxygen from the air around them and they need to drink water .
af: alle diere het suurstof uit die lug nodig om asem te haal en water om te drink .

source: some animals also use the non living things to make their shelters .
af: sommige diere gebruik ook die nie lewende dinge as hul skuilplekke .

source: for example ants rely on the soil and sand to build their nests in .
af: byvoorbeeld miere maak staat op die grond en sand om hul neste in te maak .

source: in this river ecosystem the water has dried up due to a drought .
af: in hierdie rivierekosisteem het die water opgedroog weens 'n droogte .

source: how does this affect the biodiversity of the plants and animals in this ecosystem ?
af: hoe benvloed dit die biodiversiteit van die plante en diere in hierdie ekosisteem ?

source: many animals which relied on the water as their habitat would have died such as fish frogs etc .
af: baie diere soos visse paddas ens. wat staatgemaak het op die water as hul habitat sou gesterf het .

source: in turn the birds which ate these animals would have left .
af: as gevolg daarvan sou dievols wat hierdie diere as voedsel gebruik het die habitat verlaat het .

source: plants which relied on very moist soil would have died such as reeds and water lilies .
af: plante soos riete en waterlelies wat staatgemaak het op baie klam grond sou doodgegaan het .

source: however many of these ecosystems also have animals adapted to dry seasons fish and amphibians go dormant elephants dig for water .
af: baie van hierdie ekosisteme het egter ook diere wat aangepas is om dro seisoene te oorleef visse en amfibie word dormant olifantegrawe vir water .

source: although long periods of drought are still detrimental to these animals .
af: ten spyte daarvan is lang periodes van droogte steeds nadelig vir hierdie diere .

source: in this photograph the soil has started to erode .
af: in hierdie foto het erosie van die grond plaasgevind .

source: this may be a difficult question to answer .
af: dit mag 'n moeilike vraag wees om te beantwoord .

source: it could be because the land was farmed and so the naturally occurring plants were removed .
af: dit mag wees dat daar op die stuk grond geboer is en daarom is die plante wat natuurlik voorkom verwyder .

source: there are now no roots holding the soil together .
af: daar is nou geen wortels om die grond vas te hou nie .
